/*
 * Copyright (c) 2017-2024 The Forge Interactive Inc.
 *
 * This file is part of The-Forge
 * (see https://github.com/ConfettiFX/The-Forge).
 *
 * Licensed to the Apache Software Foundation (ASF) under one
 * or more contributor license agreements.  See the NOTICE file
 * distributed with this work for additional information
 * regarding copyright ownership.  The ASF licenses this file
 * to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance
 * with the License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
 * KIND, either express or implied.  See the License for the
 * specific language governing permissions and limitations
 * under the License.
 */

#if defined(__INTELLISENSE__)
#include "../InputCommon.h"
#include "../../../OS/Input/HID/HIDInput.h"
#endif

//#define VERBOSE_SWITCH_PACKET_LOGGING

// switch controllers pack 3 packets of sensor data 5 ms apart
//   if this is uncommented all 3 packets will be pushed to the input results
#define SW_SENSOR_FREQ_5MS

#define SW_MAX_RETRIES               5
// timeout on waiting for command responses in ms
//   The controllers constantly send input events once set up; the command response

#define SW_PACKET_SIZE_USB_OUT       64
#define SW_PACKET_SIZE_BLUETOOTH_IN  49
#define SW_PACKET_SIZE_BLUETOOTH_OUT 49
#define SW_PACKET_MAX_SIZE_IN        (SW_PACKET_SIZE_USB_IN > SW_PACKET_SIZE_BLUETOOTH_IN ? SW_PACKET_SIZE_USB_IN : SW_PACKET_SIZE_BLUETOOTH_IN)
#define SW_PACKET_MAX_SIZE_OUT \
    (SW_PACKET_SIZE_USB_OUT > SW_PACKET_SIZE_BLUETOOTH_OUT ? SW_PACKET_SIZE_USB_OUT : SW_PACKET_SIZE_BLUETOOTH_OUT)

#define SW_PACKET_TYPE_IN_GENERAL_REPLY     0x21
#define SW_PACKET_TYPE_IN_SETUP_ACK         0x81
#define SW_PACKET_TYPE_IN_GENERAL_ACK       0x80
#define SW_PACKET_TYPE_IN_FULL_STATE        0x30
#define SW_PACKET_TYPE_IN_SIMPLE_STATE      0x3F

#define SW_PACKET_TYPE_OUT_SETUP            0x80
#define SW_PACKET_TYPE_OUT_GENERAL          0x01
#define SW_PACKET_TYPE_OUT_RUMBLE_ONLY      0x10

#define SW_CON_TYPE_UNKNOWN                 0x00
#define SW_CON_TYPE_JOY_L                   0x01
#define SW_CON_TYPE_JOY_R                   0x02
#define SW_CON_TYPE_PRO                     0x03

#define SW_SETUP_STATUS                     0x01
#define SW_SETUP_HANDSHAKE                  0x02
#define SW_SETUP_HIGHSPEED                  0x03
#define SW_SETUP_FORCE_USB                  0x04
#define SW_SETUP_CLEAR_USB                  0x05
#define SW_SETUP_RESET_MCU                  0x06

#define SW_COMMAND_BT_MANUAL_PAIR           0x01
#define SW_COMMAND_REQ_DEV_INFO             0x02
#define SW_COMMAND_SPI_FLASH_READ           0x10
#define SW_COMMAND_SPI_FLASH_WRITE          0x11
#define SW_COMMAND_ENABLE_IMU               0x40
#define SW_COMMAND_ENABLE_RUMBLE            0x48
#define SW_COMMAND_SET_INPUT_MODE           0x03
#define SW_COMMAND_SET_HCI_STATE            0x06
#define SW_COMMAND_SET_IMU_SENSITIVTY       0x41
#define SW_COMMAND_SET_PLAYER_LIGHT         0x30
#define SW_COMMAND_SET_HOME_LIGHT           0x38

// SwCalibration constants

#define SW_ADDR_CALIB_TRG_USER_LEFT_STATUS  0x8010u
#define SW_ADDR_CALIB_TRG_USER_LEFT         0x8012u
#define SW_ADDR_CALIB_TRG_USER_LEFT_END     0x801Au
#define SW_ADDR_CALIB_TRG_USER_RIGHT_STATUS 0x801Bu
#define SW_ADDR_CALIB_TRG_USER_RIGHT        0x801Du
#define SW_ADDR_CALIB_TRG_FAC_LEFT          0x603Du
#define SW_ADDR_CALIB_TRG_FAC_RIGHT         0x6046u

#define SW_CONST_USER_CALIB_0               0xB2u
#define SW_CONST_USER_CALIB_1               0xA1u
#define SW_CONST_LEN_USER_CALIB_STATUS      (SW_ADDR_CALIB_TRG_USER_LEFT - SW_ADDR_CALIB_TRG_USER_LEFT_STATUS)
#define SW_CONST_LEN_TRG_CALIB              (SW_ADDR_CALIB_TRG_USER_LEFT_END - SW_ADDR_CALIB_TRG_USER_LEFT + 1)

// SwCalibration
#define CALIB_TYPE_USER                     0
#define CALIB_TYPE_FACTORY                  1

// Joystick
#define SW_JX                               0
#define SW_JY                               1

// Sensor
#define SW_SX                               0
#define SW_SY                               1
#define SW_SZ                               2

// Triggers/SwRumble
#define SW_TL                               0
#define SW_TR                               1

struct SCParsedInput
{
    int16_t  leftJoystick[2];
    int16_t  rightJoystick[2];
    //  0 : Y
    //  1 : X
    //  2 : B
    //  3 : A
    //  4 : R SR
    //  5 : R SL
    //  6 : R Shoulder
    //  7 : R Trigger
    //  8 : dpad down
    //  9 : dpad up
    // 10 : dpad right
    // 11 : dpad left
    // 12 : L SR
    // 13 : L SL
    // 14 : L Shoulder
    // 15 : L Trigger
    uint16_t buttons;
    //  0 : Minus
    //  1 : Plus
    //  2 : R Stick
    //  3 : L Stick
    //  4 : Home
    //  5 : Capture
    uint8_t  lowFreqButtons;
    //   0 : Is Wired Bool
    //   4 : Fully Charged Bool
    // 5-7 : Battery level
    uint8_t  misc;

    int16_t accel[3];
    int16_t gyro[3];
};

#define SW_Y_____ 0x0001
#define SW_X_____ 0x0002
#define SW_B_____ 0x0004
#define SW_A_____ 0x0008
#define SW_R_SR__ 0x0010
#define SW_R_SL__ 0x0020
#define SW_R_SHLD 0x0040
#define SW_R_TRIG 0x0080
#define SW_DP_DWN 0x0100
#define SW_DP_UP_ 0x0200
#define SW_DP_RGT 0x0400
#define SW_DP_LFT 0x0800
#define SW_L_SR__ 0x1000
#define SW_L_SL__ 0x2000
#define SW_L_SHLD 0x4000
#define SW_L_TRIG 0x8000

#define SW_MINUS_ 0x01
#define SW_PLUS__ 0x02
#define SW_R_STCK 0x04
#define SW_L_STCK 0x08
#define SW_HOME__ 0x10
#define SW_CAPTUR 0x20

struct SwRumble
{
    uint8_t data[4];
};
COMPILE_ASSERT(sizeof(SwRumble) == 4);

struct SwCalibration
{
    int16_t mid;

    int16_t bLo;
    int16_t bHi;
};
COMPILE_ASSERT(sizeof(SwCalibration) == 6);

struct SwAxisCalibration
{
    SwCalibration x;
    SwCalibration y;
};
COMPILE_ASSERT(sizeof(SwAxisCalibration) == 12);

struct SwitchController
{
    uint8_t bluetooth : 1; // 1b
    uint8_t isGrip : 1;    // 1b
    uint8_t isRight : 1;   // 1b
    uint8_t isLeft : 1;    // 1b
    uint8_t cmdNum;        // 4b
    uint8_t type;

    SwRumble          rumble[2];
    SwAxisCalibration calib[2];
};
// if exceeded, increase HID_CONTROLLER_BUFFER_SIZE
COMPILE_ASSERT(sizeof(SwitchController) <= HID_CONTROLLER_BUFFER_SIZE);

// Packet formats for sending to the switch controllers

struct SCPacketOut_Setup
{
    uint8_t packetType;
    uint8_t command;

    uint8_t __pad0[HID_DEFAULT_PACKET_SIZE - 2];
};
COMPILE_ASSERT(sizeof(SCPacketOut_Setup) == HID_DEFAULT_PACKET_SIZE);

struct SCPacketOut_Rumble
{
    uint8_t  packetType;
    uint8_t  sequenceNum;
    SwRumble rumble[2];
};
COMPILE_ASSERT(sizeof(SCPacketOut_Rumble) == 10);

struct SCPacketOut_General
{
    uint8_t  packetType;
    uint8_t  sequenceNum;
    SwRumble rumble[2];
    uint8_t  command;
    uint8_t  data[SW_PACKET_SIZE_OUT - 11];

    uint8_t __pad0[HID_DEFAULT_PACKET_SIZE - SW_PACKET_SIZE_OUT];
};
COMPILE_ASSERT(sizeof(SCPacketOut_General) == HID_DEFAULT_PACKET_SIZE);

// Packet formats for listening to the switch controllers

#define SW_SENS__0MS 0
#define SW_SENS__5MS 1
#define SW_SENS_10MS 2

struct SCPacketIn_Input
{
    uint8_t sequenceNum;
    uint8_t battery;
    uint8_t buttons[3];
    uint8_t leftJoystick[3];
    uint8_t rightJoystick[3];
    uint8_t rumbleState;
};
COMPILE_ASSERT(sizeof(SCPacketIn_Input) == 12);

struct SCPacketIn_InputFull
{
    SCPacketIn_Input state;

    // three packets of sensor data in a row 5ms appart
    struct
    {
        int16_t accel[3];
        int16_t gyro[3];
    } sens[3];
};
COMPILE_ASSERT(sizeof(SCPacketIn_InputFull) == 48);

struct SCPacketIn_InputSimple
{
    uint8_t packetType;

    uint8_t  buttons[2];
    uint8_t  dpad;
    uint16_t leftJoystick[2];
    uint16_t rightJoystick[2];
};
COMPILE_ASSERT(sizeof(SCPacketIn_InputSimple) == 12);

struct SCPacketIn_SetupStatus
{
    uint8_t setupAck;
    uint8_t setupFlag;
    uint8_t status;

    uint8_t devType;
    uint8_t devID[6];
};
COMPILE_ASSERT(sizeof(SCPacketIn_SetupStatus) == 10);

struct SCPacketIn_CommandResults
{
    uint8_t          packetType;
    SCPacketIn_Input state;

    uint8_t ack;
    uint8_t command;

    // can be either SPIData or DevInfo
    union
    {
        uint8_t __pad1[35];
        struct
        {
            // should access the value of addr via a pointer to uint32
            uint8_t addr[4];
            uint8_t len;
            uint8_t data[30];
        } spi;

        struct
        {
            uint8_t firmwareVer[2];
            uint8_t devType;
            uint8_t __pad2;
            uint8_t devID[6];
            uint8_t __pad3;
            uint8_t colorLoc;
        } devInfo;
    };
};
COMPILE_ASSERT(sizeof(SCPacketIn_CommandResults) == 50);
COMPILE_ASSERT(offsetof(SCPacketIn_CommandResults, spi.data) == 20);
COMPILE_ASSERT(offsetof(SCPacketIn_CommandResults, devInfo.colorLoc) == 26);

// Util

void WriteLE(uint8_t* dest, uint32_t src)
{
    dest[0] = (uint8_t)(src & 0xFF);
    dest[1] = (uint8_t)((src & 0xFF00) >> 8);
    dest[2] = (uint8_t)((src & 0xFF0000) >> 16);
    dest[3] = (uint8_t)((src & 0xFF000000) >> 24);
}

int16_t Get12Bits(uint8_t* src, uint32_t start)
{
    ASSERT(start == 0 || start == 4);
    uint16_t res = 0;

    if (start == 0)
    {
        res = (uint16_t)*src;
        res |= (((uint16_t) * (src + 1)) & 0xF) << 8;
    }
    else if (start == 4) //-V547
    {
        res = (((uint16_t)*src) & 0xF0) >> 4;
        res |= ((uint16_t) * (src + 1)) << 4;
    }

    return (int16_t)res;
}

// Info

bool HIDIsSupportedSwitchController(HIDDeviceInfo* devInfo)
{
    // NOTE: Apparently there are third party controllers that only support
    //   passing input state, and can't receive packets. May be an issue
    //   in the future if we allow them to be used.
